//==================================================
// Geometry
//==================================================
SetFactory("OpenCASCADE");

D  = 1.0;

L1 = 5*D;
L2 = 20*D;
H  = 5*D;

hmin = 0.4;
hmax = 1.2;

//==================================================
// Outer domain
//==================================================
Rectangle(1) = {-L1,-H,0,L1+L2,2*H};

//==================================================
// Cylinder
//==================================================
Disk(2) = {0,0,0,D/2,D/2};

//==================================================
// Fluid domain
//==================================================
fluid[] = BooleanDifference
{
    Surface{1}; Delete;
}
{
    Surface{2}; Delete;
};

//==================================================
// Physical Groups 
//==================================================
Physical Surface("Ω") = {fluid[0]}; // 内部

Physical Curve("Γ₅") = {5}; // 圆柱
Physical Curve("Γ₄") = {6}; // 底部
Physical Curve("Γ₁") = {7}; // 左侧流入
Physical Curve("Γ₂") = {8}; // 右侧流出
Physical Curve("Γ₃") = {9}; // 顶部

//==================================================
// Mesh refinement (压力网格加密场)
//==================================================
Field[1] = Distance;
Field[1].CurvesList = {5}; // 绑定圆柱 Γ₅

Field[2] = Threshold;
Field[2].InField = 1;      // 绑定距离场 1
Field[2].SizeMin = hmin;   // 
Field[2].SizeMax = hmax;   //
Field[2].DistMin = 1.0;    // 保持核心加密半径与速度网格同步
Field[2].DistMax = 4.0;    // 过渡区边界

Background Field = 2;

Mesh.Algorithm = 6;